Repository: pepr/LearningToProgram2CZ
Catalog: en/align_2013.05.06_23.17.25/complang-czcomplang.tmx
Source language: en
Languages: cs

source: Programming Languages I Have Used
cs: Programovací jazyky, které jsem používal

source: This document lists some of the programming languages I have used or investigated (played with) over the years.
cs: V tomto dokumentu uvádím některé z programovacích jazyků, které jsem používal nebo zkoumal (tj. hrál jsem si s nimi) běhe předchozích let.

source: It is a very personal view and sometimes the views expressed will appear contradictory or even downright quirky.
cs: Jde o velmi osobní pohled. Někdy se vyjádřená hlediska mohou zdát protikladná nebo dokonce zcela překroucená.

source: That's because they reflect the author's state of mind at the time of using the particular language!
cs: Je to tím, že odrážejí můj stav mysli v době, kdy jsem ten který jazyk používal.

source: The layout arranges the languages into groups:
cs: Jazyky jsem uspořádal to těchto skupin:

source: Those that I have used 'in anger' on production work.
cs: Ty, které jsem používal a se kterými jsem se zlobil v práci.

source: Little languages used (often in production projects) for small tasks (less than 1000 lines of code).
cs: Malé jazyky, které jsem používal (často i v práci) pro řešení malých úkolů (méně, než 1000 řádků zdrojového textu).

source: Languages which I have only experimented with, never used on real development work.
cs: Jazyky, se kterými jsem pouze experimentoval a které jsem nikdy nepoužíval během opravdových vývojových prací.

source: Where it makes sense I will present a 'Hello World' program in the language.
cs: Tam, kde to bude dávat smysl, uvedu v daném jazyce program 'Hello World'.

source: In this context "production" means that I got paid for doing the work and/or that several other people are using the resulting program.
cs: Tím v práci myslím to, že jsem byl za tuto práci placen a že výsledný program používá více jiných lidí.

source: It also means that the programs were developed using industry standard software engineering practices for design and documentation etc.
cs: Mám zde na mysli také to, že tyto programy byly vyvíjeny s použitím průmyslových standardů pro vývoj software, pro jeho dokumentování a podobně.

source: When I first started using C (on a vacation project while at university) it came as a breath of fresh air after the restrictions of ANSI Pascal.
cs: Když jsem poprvé začal používat jazyk C (během prázdninového projektu, v době studia na univerzitě), bylo to jako závan svěžího vzduchu po všech těch omezeních, kladených jazykem ANSI Pascal.

source: It allowed fast expression of ideas with just enough type checking to let you know if you're being stupid but not enough to suffocate as Pascal did. It also meant excursions into Assembler were limited to those few areas where Assembler was fun!
cs: Jazyk C umožňoval rychlé vyjadřování myšlenek s právě takovou mírou typové kontroly, která vám dá poznat, že něco děláte špatně, ale ne zase s tak přísnou typovou kontrolou, která by vás vyčerpávala, jako v jazyce Pascal. Používání jazyka C současně znamenalo omezení výletů do Assembleru jen na ty oblasti, kde bylo používání Assembleru hračkou.

source: A few years later I migrated to C++ but over time I now find myself using C++ as a better C and even occasionally preferring the original.
cs: O několik let později jsem přešel k C++. Během času však shledávám, že jazyk C++ používám jako lepší C, přičemž příležitostně dávám přednost originálu.

source: C++ cranks up the type checking to near Pascal levels and adds whole wadges of new features which complicate the language and slow the compiler.
cs: C++ pozvedává typovou kontrolu téměř na úroveň jazyka Pascal a přidává celou řadu nových rysů, které jazyk komplikují a zpomalují překladač.

source: C remains one of my favourite languages and its not a coincidence or surprise that the OS everyone is talking about - Linux - is written in vanilla C and not C++.
cs: Jazyk C zůstává jedním z mých oblíbených jazyků. Není to jen shoda okolností, ani to není nijak překvapující, že operační systém, o kterém každý mluví — Linux — je napsán v čistém C a ne v C++.

source: Hello World #include void main() { char* msg="Hello World!"; /* similar idiom as OO examples */ puts(msg); }
cs: Hello World #include <stdio.h> void main() { char* msg="Hello World!"; /* podobný obrat, jako v OO příkladech */ puts(msg); }

source: C++ is C with bells on.
cs: Jazyk C++ lze přirovnat k jazyku C s přidanými zvonečky.

source: Initially the bells tinkled occasionally and made sweet music.
cs: Ty ze začátku cinkaly jen příležitostně a tvořily sladkou hudbu.

source: Now there are so many bells you can't hear the music for the noise!
cs: Ale v současnosti je těch zvonečků už tolik, že přes ten hluk už není hudba slyšet!

source: (And some modern C++ programs look like noise too!)
cs: (A některé moderní programy v C++ podle toho vypadají!)

source: I have a great admiration for C++ and for very large systems or environments where many different modes of design/programming are practiced it is peerless.
cs: K jazyku C++ chovám hluboký obdiv a pro tvorbu velmi velkých systémů nebo prostředí, kde se používá mnoho odlišných způsobů návrhu a programování, je nepřekonatelný.

source: Unfortunately that flexibility is also its downfall.
cs: Jeho pružnost naneštěstí přináší i problémy.

source: It has become almost impossible to program well in C++ without an intimate understanding of its internals, which is ironic given that one of its primary design aims is to allow the programmer to work at a greater level of abstraction.
cs: Bez intimního porozumění jeho vnitřním mechanismům se tvorba dobrých programů v C++ stala téměř nemožnou. Ironií je, že jedním z primárních cílů jeho návrhu je umožnit programátorovi práci na vyšší úrovni abstrakce.

source: Hello World #include &ltstring.h> #include &ltstdio.h> class Message // define a message class { private: char msg[50]; public: Message(char* s) {strcpy(msg,s);}; void print() {puts(msg);}; }; void main() { m = new Message("Hello World!"); m->print(); delete m; }
cs: Hello World #include <string.h> #include <stdio.h> class Message // definuj třídu pro zprávu { private: char msg[50]; public: Message(char* s) {strcpy(msg,s);}; void print() {puts(msg);}; }; void main() { m = new Message("Hello World!"); m->print(); delete m; }

source: Delphi isn't really a language, its an environment.
cs: Delphi ve skutečnosti není programovacím jazykem. Jde o vývojové prostředí.

source: But everyone tends to call the language within that environment Delphi too so I'll roll with the flow!
cs: Ale v rámci tohoto vývojového prostředí mají všichni tendenci nazývat takto i jazyk, se kterým v prostředí pracují — takže popluji s proudem.

source: The real name for the language of Delphi is Object Pascal and it is a (widely divergent) version of the language Apple used to program the first Macs.
cs: Skutečné jméno jazyka uvnitř Delphi je Object Pascal. Jde o (v mnoha směrech odlišnou) verzi jazyka, kterou firma Apple používala pro programování prvních počítačů Macintosh.

source: This in turn added OOP features to standard Pascal.
cs: Firma Apple ke standardnímu Pascalu přidala rysy související s objektově orientovaným programováním.

source: (A fuller description and demo of Apple style OP is found in Booch's OOAD 1st edition c1992)
cs: (Podrobnější popis jazyka a ukázky v jazyce Object Pascal v applovské podobě můžete nalézt v prvním vydání Boochovy knihy OOAD, 1992.)

source: Essentially Delphi's brand of OP adds the best features of C++ to Pascal but without striving for total backward compatibility or no compromise performance etc.
cs: Varianta jazyka Object Pascal, která se používá v prostředí Delphi, v podstatě přidává k jazyku Pascal ty nejlepší rysy z jazyka C++, ale nesnaží se o úplnou zpětnou kompatibilitu nebo o nekompromisní přístup z pohledu výkonnosti a podobně.

source: This results in a much more human readable and simpler language.
cs: Výsledkem je z lidského hlediska mnohem čitelnější a jednodušší jazyk.

source: For serious windows programming OP is my language of choice ad the Delphi environment is the best IDE I've used so far.
cs: Pro vážné programování ve Windows je Object Pascal jazykem, kterému dávám přednost. Prostředí Delphi je navíc nejlepším integrovaným vývojovým prostředím, které jsem kdy používal.

source: (I'm currently on V3 although V4 is the latest version at the time of writing) Hello World program hello; {---------Class definition ---------} type class=TMessage msg : String; public: constructor Create(s : String); procedure Print; end; constructor TMessage.Create(s : String); begin msg := s; end; procedure TMessage.Print; begin writeln(msg); end; {------------End class -----------} var m : TMessage //declare instance reference begin m := TMessage.Create('Hello World'); // create instance m.Print; m.Free; end.
cs: (Momentálně používám verzi 3, ačkoliv v době psaní tohoto textu je má poslední verze číslo 4.) Hello World program hello; {--------- Definice třídy ---------} type class=TMessage msg : String; public: constructor Create(s : String); procedure Print; end; constructor TMessage.Create(s : String); begin msg := s; end; procedure TMessage.Print; begin writeln(msg); end; {------------ Konec definice třídy -----------} var m : TMessage // deklarace reference na instanci begin m := TMessage.Create('Hello World'); // vytvoříme instanci m.Print; m.Free; end.

source: COBOL is one of the earliest computer languages appearing in 1959, just one year after me!
cs: COBOL patří k jednomu z prvních počítačových jazyků. Světlo světa spatřil v roce 1959, právě jeden rok po mně.

source: It is one of the latest computer languages that I have used however but no better for that!
cs: Je to jeden z posledních počítačových jazyků, které jsem používal. Tím ho ovšem nechci nijak obhajovat.

source: It is not a popular language amongst programmers and despite trying to maintain a neutral stand, I can only agree with the consensus.
cs: Mezi programátory nepatří zrovna k populárním jazykům. A ačkoliv se snažím o neutrální postoj, nezbývá mi, než s tím souhlasit.

source: COBOL has a few good features especially those specific to its bread and butter tasks of data processing, number crunching and file handling.
cs: COBOL se vyznačuje několika dobrými rysy, především těmi, které se vztahují k jeho dennímu chlebu — zpracování dat, číselné výpočty a práce se soubory.

source: In particular its report writing capabilities outshine its contemporaries and its file handling is quite simply the best in the game.
cs: Zejména jeho schopnosti generování sestav zastiňují jeho současníky. Jeho práce se soubory patří prostě k nejlepším.

source: These don't, however, make up for its negative characteristics: uppercase letters, fixed position keywords and verbosity bordering on the insane.
cs: To ovšem nevyvažuje jeho negativní vlastosti: používání velkých písmen, pevné pozice klíčových slov a ukecanost až k zbláznění.

source: I will be quite happy never to have to work with COBOL ever again.
cs: Budu docela šťastný, když už s jazykem COBOL nebudu muset nikdy víc pracovat.

source: Little Languages
cs: Malé jazyky

source: The definitive description of little languages is in a series of articles published in Dr Dobbs journal and the ICM.
cs: Vyčerpávající popis malých jazyků naleznete v sérii článků, které byly publikovány v časopise Dr. Dobbs a v ICM.

source: In particular I recommend the Programming Pearls series of books by Jon Bentley.
cs: Doporučuji sejména sérii knih Programming Pearls, kterou napsal Jon Bentley.

source: In the context of this discussion I really mean scripting languages ans some of these have actually become pretty big! awk
cs: Malými jazyky zde rozumím skriptovací jazyky. Některé z nich se však ve skutečnosti staly velmi rozsáhlými. awk

source: The first little language I came across and still a favourite.
cs: Jde o první malý jazyk, se kterým jsem se setkal, a stále patří mezi mé oblíbené.

source: It does a conceptually simple job simply and reasonably fast.
cs: Pomáhá řešit principiálně jednoduché úkoly jednoduchým a rozumně rychlým způsobem.

source: Everyone should learn awk.
cs: Měl by se jej naučit každý !

source: The key principle of operation in awk is pattern matching.
cs: Základní princip zpracování v awk je založen na vyhledávání vzorků.

source: Awk reads a text file line by line searching for patterns.
cs: Awk čte textový soubor řádek po řádku a vyhledává vzorky.

source: When it finds a pattern that it recognizes it performs whatever action(sub-routine) has been defined - the default being to print the line.
cs: Pokud nalezne některý z předepsaných vzorků, provede libovolnou akci, která pro něj byla definována. Standardně (default) je touto akcí tisk řádku.

source: An Awk program thus consists of a set of pattern/action pairs.
cs: Program v awk se tedy skládá z množiny dvojic vzorek/akce.

source: Typical uses are to extract columns from a data file, or to produce summary reports etc.
cs: Mezi jeho typická použití patří extrahování sloupců z datových souborů, generování souhrnných zpráv a podobně.

source: Note: This version prints "Hello World" every time "Hello" or "hello" is found in the input file, and gives a success count at the end. #!/bin/awk BEGIN {msg="Hello World"} /[Hh]ello/ {print msg; count++} END {print "Hello was found ", count, "times in ", FILENAME}
cs: Poznámka: Tato verze tiskne řetězec " Hello World " pokaždé, když na řádku vstupního souboru nalezne řetězec " Hello " nebo " hello ". Na závěr zobrazí počet úspěšných rozpoznání vzorků. #!/bin/awk BEGIN {msg="Hello World"} /[Hh]ello/ {print msg; count++} END {print "Hello bylo v souboru ", FILENAME, " nalezeno ", count, "krat."}

source: The flavour of the last few years, never mind month, and very powerful. Pity it reads like line noise, and on a very dodgy line at that!
cs: Perl dal příchuť několika posledním rokům, plus mínus nějaký ten měsíc. Jde o mocný nástroj. Škoda jen, že jeho řádky vypadají, jako kdyby někdo rozsypal písmenka — s velmi škodolibým záměrem.

source: I have never quite got my head round Perl - I can see the power but it just offends my senses somehow.
cs: Jazyku Perl jsem nikdy nepřišel tak úplně na chuť. Vidím sice jeho sílu, ale nějakým způsobem prostě uráží mé smysly.

source: Everything just looks a bit too much like its been stuck together with sticky tape and glue rather than coherently designed.
cs: Všechno v něm tak trochu (nebo i trochu víc), jako kdyby to drželo pohromadě spíše díky lepicí pásce a lepidlu, než díky srozumitelnému, logickému návrhu.

source: (Its OO mechanism in particular!)
cs: (Jeho mechanismu pro objektové programování se to týká především.)

source: What cannot be denied is that the WWW is driven by Perl to a very large extent and if you are curious then don't let me stop you!
cs: Nelze popřít, že svět WWW je řízen Perlem do značné míry. Pokud vás přitahuje, nenechte se mnou zastavit!

source: Instead visit: http://www.perl.org Hello World $msg = "Hello World"; print $msg;
cs: Místo toho navštivte stránky http://www.perl.org/. Hello World $msg = "Hello World"; print $msg;

source: Perl for purists, especially OO purists. I love it to bits!
cs: Je to Perl pro puristy — zejména pro objektově orientované puristy. Miluji jej do posledního bitu!

source: Python is object oriented throughout, it has an extensive module system and is designed to allow scripting on a large scale.
cs: Python je objektově orientovaný skrz naskrz. Jeho součástí je rozsáhlý systém modulů. Python je navržen tak, aby dovoloval skriptování ve velkém [1].

source: Although much less well known than Perl you can achieve pretty much the same results for the same effort in Python as you can with Perl - and you might even understand the resultant code 6 months later.
cs: Ačkoliv je mnohem méně známý, než Perl, můžete v jazyce Python dosáhnout stejných výsledků při srovnatelném úsilí — a výslednému kódu budete pravděpodobně rozumět dokonce i po šesti měsících.

source: Hello World #!/local/bin/python class Message: def __init__(self, str="No message provided"): self.text = str def print(self): print self.text if __name__ == "__main__": m = Message("Hello World") m.print()
cs: Hello World #!/local/bin/python class Message: def __init__(self, str="No message provided"): self.text = str def printIt(self): print self.text if __name__ = "__main__": m = Message("Hello World") m.printIt()

source: Unix Shells
cs: Unixový shell

source: Pick your favourite.
cs: Vyberte si váš oblíbený.

source: A command prompt with real power.
cs: Jde o příkazový procesor s opravdovou silou.

source: You can do if, case, while and for loops.
cs: Můžete v něm realizovat větvení if, case, i cykly while a for.

source: You can test for file type(directory, system file, access etc) There's command history access, filename and command completion, executing jobs in foreground or background etc etc.
cs: Můžete v něm testovat typ souboru (zda se jedná o adresář, systémový soubor, přístupová práva, atd.) Udržuje historii použitých příkazů, podporuje automatické doplňování jména souboru nebo příkazu, umožňuje provádění úloh v popředí nebo v pozadí, a tak dále, a tak dále.

source: DOS Batch/NT Command
cs: Dávkový jazyk pro DOS a Window

source: What can I say? A command prompt with no power?
cs: Co bych k němu mohl říci? Příkazový procesor s mizernou silou?

source: Amazingly some people have twisted it to achieve amazing things.
cs: Některým lidem se podařilo vymáčnout z něj maximum a dosáhnout neuvěřitlené věci.

source: I still hate it though and wish Microsoft would provide a really useful batch language for Windows/NT (and shipping Perl in the Resource Kit doesn't count guys!).
cs: Přesto jej nemám rád a přál bych si, aby Microsoft poskytnul opravdu užitečný dávkový jazyk pro Windows NT. (Ale pánové, dodávání instalace jazyka Perl jako součást Resource Kit, se nepočítá!)

source: Hello World SET MSG="Hello World" ECHO %MSG% Experimental Languages
cs: Hello World SET MSG="Hello World" ECHO %MSG% Experimentální jazyky

source: Experimental here means that I have experimented with these languages.
cs: Označení experimentální se zde vztahuje k mé osobě — experimetnoval jsem s nimi.

source: It does not mean that they are some kind of computer science experiment.
cs: To ovšem neznamená, že tyto jazyky představují nějaký experiment z pohledu počítačové vědy.

source: Rather I have used these languages to write some kind of minimalist application, but only for the purpose of educating myself about the language.
cs: Spíše by se dalo říct, že jsem v těchto jazycích napsal svým způsobem minimalistické aplikace jen proto, abych se o těchto jazycích něco dozvěděl.

source: The dividing line between some of these and the little languages above is fine, but ultimately the little languages have produced tools which I use in earnest, the experimental ones produced tools which I do not use on a regular basis.
cs: Dělící čára mezi těmito jazyky a jazyky, které jsem označil jako malé, je velmi tenká. V malých jazycích jsem ovšem vytvořil nástroje, které skutečně používám. V experimentálních jazycích jsem vytvořil nástroje, které běžně nepoužívám.

source: This is not to denigrate these languages in any way - they are all production languages to someone else and I have learned valuable lessons about programming from all of them.
cs: Tím ovšem nechci tvrdit, že jde o nějaké podřadné jazyky. Každý z nich je jinými programátory používán pro tvorbu aplikací. A každý z nich mi dal cenné lekce, týkající se programování.

source: I heartily recommend to any wannabe programmer that he/she experience as many different styles of programming as possible - and these languages all offer something different from the more mainstream languages above.
cs: Každému, kdo chce být programátorem, srdečně doporučuji, aby si vyzkoušel co nejvíce různých stylů programování. Všechny tyto jazyky v sobě mají něco, čím se liší od jazyků hlavního proudu, o kterých jsme se zmínili výše.

source: BASIC was technically my first programming language.
cs: BASIC byl v podstatě mým prvním programovacím jazykem.

source: But what I did with it was so trivial that I don't really consider it programming.
cs: Ale věci, které jsem v něm dělal, byly tak jednoduché, že je ani nepovažuji za programování.

source: I really started using BASIC on my CP/M Microcomputer and it introduced me to Random Access files.
cs: BASIC jsem začal používat na svém mikropočítači s operačním systémem CP/M. Seznámil jsem se přes něj se soubory s náhodným přístupem.

source: I still occasionally play with BASIC - especially if I'm working on a PC and its the only programming tool around!
cs: Občas si ještě s jazykem BASIC hraji — zejména, když pracuji na nějakém počítači, kde je to jediný programátorský nástroj, který je tam nainstalovaný.

source: Visual Basic aficionados keep trying to persuade me that the modern dialects of the language are of good quality, but despite downloading the free CCE edition and creating a few simple apps, I just cannot work up any real enthusiasm.
cs: Nadšenci spojení pupeční šňůrou s jazykem Visual Basic mne neustále přesvědčují o tom, že kvalita moderního dialektu tohoto jazyka je dobrá. Ale přesto, že jsem si stáhl jeho zdarma dostupné vydání zvané CCE a vytvořil jsem pár jednoduchých aplikací, nevyvolal ve mně žádné opravdové nadšení.

source: Sorry BASIC.
cs: Bejziku, je mi líto.

source: Lisp is described by its fans as 'the only beautiful programming language'.
cs: Fanoušci jazyka Lisp jej popisují jako jediný krásný programovací jazyk.

source: Its detractors say Lisp stands for 'Lots of Irrelevant Silly Parentheses'.
cs: Jeho zavilí kritici říkají, že Lisp znamená Lots of Irrelevant Silly Parentheses.

source: I sympathize with both views.
cs: Sympatizuji s oběma názory.

source: Lisp really stands for List Processing and is very descriptive of how the language both looks and works.
cs: Slovo Lisp ve skutečnosti znamená List Processing (čili zpracování seznamů). Tento jazyk je velmi názorný v tom smyslu jak vypadá a jak funguje.

source: Everything in Lisp is either a list or an atom - an atom is an element of a list which is not itself a list.
cs: V jazyce Lisp je vše buď seznam nebo atom. Atomem se rozumí prvek seznamu, který sám o sobě není seznamem.

source: It is this fundamental cleanness of form and its simple syntax which provokes the 'beautiful language' reaction above.
cs: Právě zmíněná zásadní čistota formy a jednoduchá syntaxe představují vlastnosti, které provokují k výše zmíněnému postoji o kráse jazyka.

source: What I learned from Lisp is a different way to structure problems, use of recursion (something I had previously avoided as too complicated) and an appreciation of the notion that data can be a program and vice versa.
cs: U Lispu jsem se naučil jiné způsoby strukturování problému, používat rekurzi (tedy něco, čemu jsem se dříve vyhýbal jako příliš komplikovanému) a oceňovat nápad, že data mohou být použita jako program a naopak.

source: The other notable thing about Lisp is that it is one of the very earliest Computer Languages along with COBOL and Fortran.
cs: Další věc, která u jazyka Lisp stojí za zmínku, je skutečnost, že jde o jeden z prvních počítačových jazyků, spolu s jazyky COBOL a Fortran.

source: I find it interesting that these earliest languages are still each going strong in their respective fields while more modern languages (Algol, PL/1, CORAL, even ADA) have bloomed then faded from sight.
cs: Považuji za zajímavé, že všechny tyto nejrannější jazyky jsou ve svých oblastech nasazení stále vnímány jako mocné, zatímco některé modernější jazyky (Algol, PL/1, CORAL a dokonce ADA) prošly obdobím rozmachu a pak zmizely z očí.
